# StairsDesiredNumberOfRisers Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDesiredNumberOfRisers Property
ParameterTypeId Class See Also
---
"Desired Number of Risers": The number of risers is calculated based on stairs height
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDesiredNumberOfRisers { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDesiredNumberOfRisers As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDesiredNumberOfRisers {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace